<a href="https://colab.research.google.com/github/UniLu-DMDB/UniLu-DMDB.github.io/blob/main/Intro_to_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

University of Lucerne

Data Modeling and Database Systems

# Intro to SQL

## 1. Preparation

We start by setting up a connection to our database.

In [1]:
#@title Install PostgreSQL
#@markdown Run this cell to setup the full PostgreSQL environment. **Note that all your data is lost after restarting the runtime.**

%%capture
# Install postgresql server
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start

# Setup a password `postgres` for username `postgres`
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

In [2]:
# import all packages

from sqlalchemy import create_engine
from sqlalchemy import URL

import pandas as pd

In [3]:
%load_ext sql

In [ ]:
# load the SQL magic extension
# https://github.com/catherinedevlin/ipython-sql
# this extension allows us to connect to DBs and issue SQL command
%load_ext sql

In [7]:
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [4]:
%sql postgresql://postgres:postgres@localhost:5432/postgres

In [5]:
%%sql
CREATE TABLE Students (
	studentID INT CHECK (studentID > 0) PRIMARY KEY,
	fname VARCHAR(100) NOT NULL,
	lname VARCHAR(100) NOT NULL,
	lives_in VARCHAR(100),
	matric_year SMALLINT check (matric_year > 1900)
);

INSERT INTO Students VALUES (1, 'Jessica', 'Bezos', 'USA', 1982);
INSERT INTO Students VALUES (2, 'Bill', 'Doors', 'USA', 1973);
INSERT INTO Students VALUES (3, 'Elona', 'Musk', 'Space', NULL);
INSERT INTO Students VALUES (4, 'Tim', 'Baker', 'USA', 1982);
INSERT INTO Students VALUES (5, 'Mark', 'Sugarhill', 'Metaverse', 2002);
INSERT INTO Students VALUES (6, 'Mark', 'Diverseen', NULL, 1993);


CREATE TABLE Diplomas (
	diplomaID INT PRIMARY KEY,
	studentID INT REFERENCES Students,
	diploma VARCHAR(100) NOT NULL,
	university VARCHAR(100) NOT NULL,
	issue_date SMALLINT NOT NULL
);

INSERT INTO Diplomas VALUES (1, 1, 'Bachelor of Science', 'Princeton', 1986);
INSERT INTO Diplomas VALUES (2, 2, 'Honorary Doctorate', 'KTH', 2002);
INSERT INTO Diplomas VALUES (3, 2, 'Honorary Doctorate', 'Cambridge', 2009);
INSERT INTO Diplomas VALUES (4, 4, 'MBA', 'Duke', 1988);
INSERT INTO Diplomas VALUES (5, 5, 'Honorary Doctorate', 'Harvard', 2017);
INSERT INTO Diplomas VALUES (6, NULL, 'Funny Award', 'My University', 2021);

 * postgresql://postgres:***@localhost:5432/postgres
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

The following tables are present in the file you just downloaded:

In [10]:
%%sql
SELECT * FROM pg_catalog.pg_tables WHERE schemaname = 'public';

 * postgresql://postgres:***@localhost:5432/postgres
2 rows affected.

[('public', 'students', 'postgres', None, True, False, True, False),
 ('public', 'diplomas', 'postgres', None, True, False, True, False)]

## 2. Queries

### Basic Queries

In [11]:
%%sql
SELECT *
FROM Students

 * postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[(1, 'Jessica', 'Bezos', 'USA', 1982),
 (2, 'Bill', 'Doors', 'USA', 1973),
 (3, 'Elona', 'Musk', 'Space', None),
 (4, 'Tim', 'Baker', 'USA', 1982),
 (5, 'Mark', 'Sugarhill', 'Metaverse', 2002),
 (6, 'Mark', 'Diverseen', None, 1993)]

In [12]:
%%sql
SELECT *
FROM Students
WHERE lname = 'Musk'

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(3, 'Elona', 'Musk', 'Space', None)]

In [13]:
%%sql
SELECT *
FROM Students
WHERE matric_year = 1982

 * postgresql://postgres:***@localhost:5432/postgres
2 rows affected.

[(1, 'Jessica', 'Bezos', 'USA', 1982), (4, 'Tim', 'Baker', 'USA', 1982)]

In [14]:
%%sql
SELECT lname as lastname
FROM Students
WHERE lives_in = 'USA'

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[('Bezos',), ('Doors',), ('Baker',)]

In [15]:
%%sql
SELECT lname
FROM Students
WHERE lives_in IS NULL

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('Diverseen',)]

In [16]:
%%sql
SELECT DISTINCT fname
FROM Students
WHERE matric_year > 1990

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[('Mark',)]

In [17]:
%%sql
SELECT lname, lives_in
FROM Students
WHERE lives_in NOT IN ('USA')

 * postgresql://postgres:***@localhost:5432/postgres
2 rows affected.

[('Musk', 'Space'), ('Sugarhill', 'Metaverse')]

In [18]:
%%sql
SELECT lname, matric_year
FROM Students
WHERE lives_in IN ('USA')
ORDER BY matric_year ASC

 * postgresql://postgres:***@localhost:5432/postgres
3 rows affected.

[('Doors', 1973), ('Bezos', 1982), ('Baker', 1982)]

In [19]:
%%sql
SELECT COUNT(*) AS c
FROM Students

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(6,)]

In [20]:
%%sql
SELECT MAX(matric_year)
FROM Students

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(2002,)]

### Joins

In [21]:
%%sql
SELECT s.fname, s.lname, d.diploma
FROM Students AS s, Diplomas AS d
WHERE s.studentid = d.studentid

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Jessica', 'Bezos', 'Bachelor of Science'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Tim', 'Baker', 'MBA'),
 ('Mark', 'Sugarhill', 'Honorary Doctorate')]

In [22]:
%%sql
SELECT s.fname, s.lname, d.diploma
FROM Students AS s INNER JOIN Diplomas AS d ON (s.studentid = d.studentid)

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[('Jessica', 'Bezos', 'Bachelor of Science'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Tim', 'Baker', 'MBA'),
 ('Mark', 'Sugarhill', 'Honorary Doctorate')]

In [23]:
%%sql
SELECT s.fname, s.lname, d.diploma
FROM Students AS s LEFT JOIN Diplomas AS d ON (s.studentid = d.studentid)

 * postgresql://postgres:***@localhost:5432/postgres
7 rows affected.

[('Jessica', 'Bezos', 'Bachelor of Science'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Tim', 'Baker', 'MBA'),
 ('Mark', 'Sugarhill', 'Honorary Doctorate'),
 ('Mark', 'Diverseen', None),
 ('Elona', 'Musk', None)]

In [24]:
%%sql
SELECT s.fname, s.lname, d.diploma
FROM Students AS s RIGHT JOIN Diplomas AS d ON (s.studentid = d.studentid)

 * postgresql://postgres:***@localhost:5432/postgres
6 rows affected.

[('Jessica', 'Bezos', 'Bachelor of Science'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Tim', 'Baker', 'MBA'),
 ('Mark', 'Sugarhill', 'Honorary Doctorate'),
 (None, None, 'Funny Award')]

In [25]:
%%sql
SELECT s.fname, s.lname, d.diploma
FROM Students AS s FULL OUTER JOIN Diplomas AS d ON (s.studentid = d.studentid)

 * postgresql://postgres:***@localhost:5432/postgres
8 rows affected.

[('Jessica', 'Bezos', 'Bachelor of Science'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Tim', 'Baker', 'MBA'),
 ('Mark', 'Sugarhill', 'Honorary Doctorate'),
 (None, None, 'Funny Award'),
 ('Mark', 'Diverseen', None),
 ('Elona', 'Musk', None)]

In [26]:
%%sql
SELECT s.fname, s.lname, d.diploma
FROM Students AS s CROSS JOIN Diplomas AS d

 * postgresql://postgres:***@localhost:5432/postgres
36 rows affected.

[('Jessica', 'Bezos', 'Bachelor of Science'),
 ('Bill', 'Doors', 'Bachelor of Science'),
 ('Elona', 'Musk', 'Bachelor of Science'),
 ('Tim', 'Baker', 'Bachelor of Science'),
 ('Mark', 'Sugarhill', 'Bachelor of Science'),
 ('Mark', 'Diverseen', 'Bachelor of Science'),
 ('Jessica', 'Bezos', 'Honorary Doctorate'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Elona', 'Musk', 'Honorary Doctorate'),
 ('Tim', 'Baker', 'Honorary Doctorate'),
 ('Mark', 'Sugarhill', 'Honorary Doctorate'),
 ('Mark', 'Diverseen', 'Honorary Doctorate'),
 ('Jessica', 'Bezos', 'Honorary Doctorate'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Elona', 'Musk', 'Honorary Doctorate'),
 ('Tim', 'Baker', 'Honorary Doctorate'),
 ('Mark', 'Sugarhill', 'Honorary Doctorate'),
 ('Mark', 'Diverseen', 'Honorary Doctorate'),
 ('Jessica', 'Bezos', 'MBA'),
 ('Bill', 'Doors', 'MBA'),
 ('Elona', 'Musk', 'MBA'),
 ('Tim', 'Baker', 'MBA'),
 ('Mark', 'Sugarhill', 'MBA'),
 ('Mark', 'Diverseen', 'MBA'),
 ('Jessica', 'Bezos', 'Honorary Doctorate'),
 ('Bill', 'Doors', 'Honorary Doctorate'),
 ('Elona', 'Musk', 'Honorary Doctorate'),
 ('Tim', 'Baker', 'Honorary Doctorate'),
 ('Mark', 'Sugarhill', 'Honorary Doctorate'),
 ('Mark', 'Diverseen', 'Honorary Doctorate'),
 ('Jessica', 'Bezos', 'Funny Award'),
 ('Bill', 'Doors', 'Funny Award'),
 ('Elona', 'Musk', 'Funny Award'),
 ('Tim', 'Baker', 'Funny Award'),
 ('Mark', 'Sugarhill', 'Funny Award'),
 ('Mark', 'Diverseen', 'Funny Award')]